import 'package:flutter/material.dart'; // মেটেরিয়াল ডিজাইন প্যাকেজ ইমপোর্ট করা

void main() {
  // ডার্ট এক্সিকিউশনের মূল এন্ট্রি পয়েন্ট ফাংশন
  runApp(
    // ফ্ল্যাটার ইঞ্জিন স্টার্ট করে রুট উইজেট স্ক্রিনে মাউন্ট করা
    const MaterialApp(
      //const: কম্পাইল টাইমে কনস্ট্যান্ট মান নির্ধারণ করা, যা RUNTIME এ পরিবর্তন করা যায় না
      // মেটেরিয়াল অ্যাপ্লিকেশনের রুট কনফিগারেশন উইজেট
      home: Scaffold(
        // বেসিক মেটেরিয়াল স্ক্রিন লেআউট প্রোভাইডার
        body: Center(
          // কনটেন্টকে স্ক্রিনের মাঝে রাখার উইজেট
          child: Text(
            // child & children: একটি উইজেটের মধ্যে অন্য উইজেট রাখার জন্য ব্যবহৃত প্রপার্টি child: একটি উইজেটের মধ্যে একক উইজেট রাখার জন্য ব্যবহৃত প্রপার্টি, children: একটি উইজেটের মধ্যে একাধিক উইজেট রাখার জন্য ব্যবহৃত প্রপার্টি
            // টেক্সট দেখানোর উইজেট
            'রুট অ্যাপ স্ট্রাকচার', // স্ক্রিনে প্রদর্শিত মূল টেক্সট
          ),
        ),
      ),
    ),
  );
}
